Documents/бит_УстановкаСчетчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_УстановкаСчетчика</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_СведенияПоУслугамЛС</xr:Item>
				<xr:Item>AccumulationRegister.бит_ПоказанияСчетчиков</xr:Item>
				<xr:Item>InformationRegister.бит_ПоверкаСчетчиков</xr:Item>
				<xr:Item>InformationRegister.бит_ГрупповыеСчетчики</xr:Item>
				<xr:Item>InformationRegister.бит_СчетчикиНаУслугахОбщий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВведеныРазовые</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийУстановкаСчетчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПравилоУменьшения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСтавкуПоСчетчику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоУстановкиСчетчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Комнаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Многотарифный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодборРазныеЗдания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Comment>Приоритет общедомового счетчика</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетчикСЗависимымиУслугами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>лб_УстановкаСчетчикаНаДомБезЛС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КонечныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнаяУслуга</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимПотребления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРаспределения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРаспределения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРаспределенияУменьшения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРаспределения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчетаУменьшения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусКвартиры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКвартиры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСпособРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>120</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Индивидуальный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядковыйНомерСчетчикаПоУслуге</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстановленныйСчетчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/бит_ПоказанияСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_ПоказанияСчетчиков</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоследниеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеПоказанияИнспектора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеПоказанияНаселения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказанияПодкрутка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/бит_ГрупповыеСчетчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ГрупповыеСчетчики</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьИндивидуальныйСчетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрупповойСчетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПорядковыйНомерСчетчикаПоУслуге</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПоверкаСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПоверкаСчетчиков</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СнятНаПоверку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ТипСчетчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ТипСчетчика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Групповой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Индивидуальный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_СпособыРаспределения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_СпособыРаспределения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСчетчикам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНормативам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИспользуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОсновномуСпособуРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНачислениям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСпособуРасчетаНачисления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСпособуРасчетаФакт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОсновномуСпособуРасчетаС_УчетомСтавки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_УстановкаСчетчика/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеременныеМодуля

Перем мДатаДокумента; // Хранит старую дату документа; 

#КонецОбласти

#Область ОбеспечениеПроведенияДокумента

// <Описание функции>.
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>.
//                 <продолжение описания параметра>.
//  <Параметр2>  - <Тип.Вид> - <описание параметра>.
//                 <продолжение описания параметра>.
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>.
//
Функция ПроверкаИсточникаПоказаний()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"   , Дата);
	Запрос.УстановитьПараметр("Счетчик", Счетчик);
	Запрос.УстановитьПараметр("Объект" , Объект);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток) КАК ТекущиеПоказанияИнспектораОстаток,
	|	СУММА(бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток) КАК ТекущиеПоказанияНаселенияОстаток,
	|	СУММА(бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток) КАК ПоказанияПодкруткаОстаток,
	|	бит_ПоказанияСчетчиковОстатки.Объект
	|ПОМЕСТИТЬ Показания
	|ИЗ
	|	РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(
	|			&Дата,
	|			Объект = &Объект
	|				И Счетчик = &Счетчик) КАК бит_ПоказанияСчетчиковОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПоказанияСчетчиковОстатки.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫБОР
	|		КОГДА Показания.ПоказанияПодкруткаОстаток <> 0
	|			ТОГДА ""Подкрутка""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Показания.ТекущиеПоказанияНаселенияОстаток <> 0
	|					ТОГДА ""Население""
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Показания.ТекущиеПоказанияИнспектораОстаток <> 0
	|							ТОГДА ""Инспектор""
	|						ИНАЧЕ ""Ошибка""
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Метка
	|ИЗ
	|	Показания КАК Показания";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Метка = Выборка.Метка;
		
	Иначе
		
		Метка = "Ошибка";
	КонецЕсли;
	
	Возврат Метка;
	
КонецФункции // ()

// Процедура проверяет правильность заполнения реквизитов документа.
//
Процедура ПроверкаРеквизитовТЧ(ТаблицаТЧ, СтруктураШапкиДокумента, Отказ, Заголовок) Экспорт
	
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Услуги", Новый Структура("Услуга"), Отказ, Заголовок);
	
КонецПроцедуры // ПроверкаРеквизитов()

// Выполняет движения по регистрам.
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоУслугам, Отказ, Заголовок)
	
	Метка = ПроверкаИсточникаПоказаний();                   
	
	Если Метка = "Ошибка" Тогда
		
		Если Счетчик.ТипСчетчика = Перечисления.бит_ТипСчетчика.Групповой Тогда
			Метка = "Инспектор";
		Иначе
			Метка = "Население";
		КонецЕсли; 
		
	КонецЕсли;
	
	// Если ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.УстановкаСчетчика.
	//	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.СнятиеСчетчика Тогда.
	Если Счетчик.ТипСчетчика = Перечисления.бит_ТипСчетчика.Индивидуальный Тогда
		
		Для Каждого СтрокаТЧ Из Услуги Цикл
			
			Движение = Движения.бит_ПоказанияСчетчиков.Добавить();
			Движение.ВидДвижения = ?(ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.УстановкаСчетчика
			ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.ДобавитьУслугиНаСчетчик,
			ВидДвиженияНакопления.Приход,
			ВидДвиженияНакопления.Расход);
			
			Движение.Период      = Дата;
			Движение.Счетчик     = Счетчик;
			Движение.Услуга      = СтрокаТЧ.Услуга;
			Движение.Объект      = Объект;
			Движение.Коэффициент = Счетчик.КоэффициентУмножения;
			
			НачПок = ?(Многотарифный, СтрокаТЧ.НачальныеПоказания, НачальныеПоказания);
			КонПок = ?(Многотарифный, СтрокаТЧ.КонечныеПоказания , КонечныеПоказания);
			
			Движение.ПоследниеПоказания         = НачПок;
			
			Если Метка = "Подкрутка" Тогда
				Движение.ТекущиеПоказанияИнспектора = 0;
				Движение.ТекущиеПоказанияНаселения  = 0;
				Движение.ПоказанияПодкрутка         = КонПок;
			ИначеЕсли Метка = "Инспектор" Тогда
				Движение.ТекущиеПоказанияИнспектора = КонПок;
				Движение.ТекущиеПоказанияНаселения  = 0;
				Движение.ПоказанияПодкрутка         = 0;
			ИначеЕсли Метка = "Население" Тогда
				Движение.ТекущиеПоказанияИнспектора = 0;
				Движение.ТекущиеПоказанияНаселения  = КонПок;
				Движение.ПоказанияПодкрутка         = 0;
			КонецЕсли;
			
			// БИТ_ЖКХ 29.05.2014	
			Движение.Организация   = СтруктураШапкиДокумента.Организация;
			// БИТ_ЖКХ 29.05.2014
			
			НовЗапись = Движения.бит_СчетчикиНаУслугахОбщий.Добавить();
			
			НовЗапись.Период        = Дата;
			НовЗапись.Объект        = Объект;
			НовЗапись.Услуга        = СтрокаТЧ.Услуга;
			НовЗапись.Счетчик       = Счетчик;
			НовЗапись.Использовать  = ?(ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.УстановкаСчетчика
			ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.ДобавитьУслугиНаСчетчик
			,Истина,Ложь);
			НовЗапись.ТипСчетчика   = Счетчик.ТипСчетчика;
			НовЗапись.Многотарифный = Многотарифный;
			НовЗапись.СпособРасчета = СпособРасчета;
			
			НовЗапись.СпособРаспределения           = Перечисления.бит_СпособыРаспределения.НеИспользуется;
			НовЗапись.СпособРаспределенияУменьшения = Перечисления.бит_СпособыРаспределения.НеИспользуется;
			
			НовЗапись.МестоУстановкиСчетчика        = МестоУстановкиСчетчика;
			НовЗапись.Приоритет                     = Приоритет;
			НовЗапись.ИспользоватьСтавкуПоСчетчику  = ИспользоватьСтавкуПоСчетчику;
			НовЗапись.Поставщик                     = СтрокаТЧ.Поставщик;
			НовЗапись.СтатусКвартиры                = СтрокаТЧ.СтатусКвартиры;
			НовЗапись.ТипКвартиры                   = СтрокаТЧ.ТипКвартиры;
			НовЗапись.РежимПотребления              = СтрокаТЧ.РежимПотребления;
			
		КонецЦикла;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Если ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.ДобавитьЗданияНаСчетчик Тогда
			
			Запрос.УстановитьПараметр("Счетчик", Счетчик);
			Запрос.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация);
			// БИТ_ЖКХ 09.06.2016 15:10:47 Начало правки... 
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	МАКСИМУМ(бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект) КАК Объект,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга КАК Услуга,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Многотарифный КАК Многотарифный,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРасчета КАК СпособРасчета,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРаспределения КАК СпособРаспределения,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРаспределенияУменьшения КАК СпособРаспределенияУменьшения,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.МестоУстановкиСчетчика КАК МестоУстановкиСчетчика,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Приоритет КАК Приоритет,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ИспользоватьСтавкуПоСчетчику КАК ИспользоватьСтавкуПоСчетчику,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Поставщик КАК Поставщик,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ТипКвартиры КАК ТипКвартиры,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.РежимПотребления КАК РежимПотребления,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СчетчикСЗависимымиУслугами КАК СчетчикСЗависимымиУслугами,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ОсновнаяУслуга КАК ОсновнаяУслуга,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ИспользоватьПравилоУменьшения КАК ИспользоватьПравилоУменьшения,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРасчетаУменьшения КАК СпособРасчетаУменьшения,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать КАК Использовать
			|ПОМЕСТИТЬ ТаблицаУслуг
			|ИЗ
			|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
			|ГДЕ
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик = &Счетчик
			|	И бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
			|
			|СГРУППИРОВАТЬ ПО
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Многотарифный,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРасчета,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРаспределения,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРаспределенияУменьшения,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.МестоУстановкиСчетчика,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Приоритет,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ИспользоватьСтавкуПоСчетчику,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Поставщик,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СтатусКвартиры,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ТипКвартиры,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.РежимПотребления,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СчетчикСЗависимымиУслугами,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ОсновнаяУслуга,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.ИспользоватьПравилоУменьшения,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.СпособРасчетаУменьшения,
			|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Услуга
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	бит_ПоказанияСчетчиковОстатки.Услуга КАК Услуга,
			|	бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток КАК ПоследниеПоказанияОстаток,
			|	бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток КАК ТекущиеПоказанияИнспектораОстаток
			|ПОМЕСТИТЬ ВТ_НачальныеПоказания
			|ИЗ
			|	РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(
			|			,
			|			Организация = &Организация
			|				И Счетчик = &Счетчик
			|				И Объект В
			|					(ВЫБРАТЬ
			|						ТаблицаУслуг.Объект
			|					ИЗ
			|						ТаблицаУслуг КАК ТаблицаУслуг)) КАК бит_ПоказанияСчетчиковОстатки
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Услуга
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	бит_УстановкаСчетчикаЛицевыеСчета.Услуга КАК Услуга,
			|	бит_УстановкаСчетчикаЛицевыеСчета.ЛицевойСчет,
			|	бит_УстановкаСчетчикаЛицевыеСчета.Здание КАК Здание,
			|	ТаблицаУслуг.Многотарифный КАК Многотарифный,
			|	ТаблицаУслуг.СпособРасчета КАК СпособРасчета,
			|	ТаблицаУслуг.СпособРаспределения КАК СпособРаспределения,
			|	ТаблицаУслуг.СпособРаспределенияУменьшения КАК СпособРаспределенияУменьшения,
			|	ТаблицаУслуг.МестоУстановкиСчетчика КАК МестоУстановкиСчетчика,
			|	ТаблицаУслуг.Приоритет КАК Приоритет,
			|	ТаблицаУслуг.ИспользоватьСтавкуПоСчетчику КАК ИспользоватьСтавкуПоСчетчику,
			|	ТаблицаУслуг.Поставщик КАК Поставщик,
			|	ТаблицаУслуг.СтатусКвартиры КАК СтатусКвартиры,
			|	ТаблицаУслуг.ТипКвартиры КАК ТипКвартиры,
			|	ТаблицаУслуг.РежимПотребления КАК РежимПотребления,
			|	ТаблицаУслуг.СчетчикСЗависимымиУслугами КАК СчетчикСЗависимымиУслугами,
			|	ТаблицаУслуг.ОсновнаяУслуга КАК ОсновнаяУслуга,
			|	ТаблицаУслуг.ИспользоватьПравилоУменьшения КАК ИспользоватьПравилоУменьшения,
			|	ТаблицаУслуг.СпособРасчетаУменьшения КАК СпособРасчетаУменьшения,
			|	ТаблицаУслуг.Использовать КАК Использовать,
			|	ЕСТЬNULL(ВТ_НачальныеПоказания.ПоследниеПоказанияОстаток, 0) КАК НачальныеПоказания,
			|	ЕСТЬNULL(ВТ_НачальныеПоказания.ТекущиеПоказанияИнспектораОстаток, 0) КАК КонечныеПоказания
			|ИЗ
			|	Документ.бит_УстановкаСчетчика.ЛицевыеСчета КАК бит_УстановкаСчетчикаЛицевыеСчета
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаУслуг КАК ТаблицаУслуг
			|		ПО бит_УстановкаСчетчикаЛицевыеСчета.Услуга = ТаблицаУслуг.Услуга
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НачальныеПоказания КАК ВТ_НачальныеПоказания
			|		ПО бит_УстановкаСчетчикаЛицевыеСчета.Услуга = ВТ_НачальныеПоказания.Услуга
			|ГДЕ
			|	бит_УстановкаСчетчикаЛицевыеСчета.Ссылка = &Ссылка
			|ИТОГИ
			|	МАКСИМУМ(Многотарифный),
			|	МАКСИМУМ(СпособРасчета),
			|	МАКСИМУМ(СпособРаспределения),
			|	МАКСИМУМ(СпособРаспределенияУменьшения),
			|	МАКСИМУМ(МестоУстановкиСчетчика),
			|	МАКСИМУМ(Приоритет),
			|	МАКСИМУМ(ИспользоватьСтавкуПоСчетчику),
			|	МАКСИМУМ(Поставщик),
			|	МАКСИМУМ(СтатусКвартиры),
			|	МАКСИМУМ(ТипКвартиры),
			|	МАКСИМУМ(РежимПотребления),
			|	МАКСИМУМ(СчетчикСЗависимымиУслугами),
			|	МАКСИМУМ(ОсновнаяУслуга),
			|	МАКСИМУМ(ИспользоватьПравилоУменьшения),
			|	МАКСИМУМ(СпособРасчетаУменьшения),
			|	МАКСИМУМ(Использовать),
			|	МАКСИМУМ(НачальныеПоказания),
			|	МАКСИМУМ(КонечныеПоказания)
			|ПО
			|	Услуга,
			|	Здание
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ТаблицаУслуг";
			// БИТ_ЖКХ 09.06.2016 15:10:50 Конец правки. 
		Иначе
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	бит_УстановкаСчетчикаУслуги.СпособРаспределения КАК СпособРаспределения,
			|	бит_УстановкаСчетчикаУслуги.НачальныеПоказания КАК НачальныеПоказания,
			|	бит_УстановкаСчетчикаУслуги.КонечныеПоказания КАК КонечныеПоказания,
			|	бит_УстановкаСчетчикаУслуги.Поставщик КАК Поставщик,
			|	бит_УстановкаСчетчикаУслуги.СтатусКвартиры КАК СтатусКвартиры,
			|	бит_УстановкаСчетчикаУслуги.ТипКвартиры КАК ТипКвартиры,
			|	бит_УстановкаСчетчикаУслуги.Услуга КАК Услуга,
			|	бит_УстановкаСчетчикаУслуги.РежимПотребления,
			|	бит_УстановкаСчетчикаУслуги.ОсновнаяУслуга,
			|	бит_УстановкаСчетчикаУслуги.СпособРасчетаУменьшения,
			|	бит_УстановкаСчетчикаУслуги.СпособРаспределенияУменьшения
			|ПОМЕСТИТЬ ТаблицаУслуг
			|ИЗ
			|	Документ.бит_УстановкаСчетчика.Услуги КАК бит_УстановкаСчетчикаУслуги
			|ГДЕ
			|	бит_УстановкаСчетчикаУслуги.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	бит_УстановкаСчетчикаЛицевыеСчета.Услуга КАК Услуга,
			|	бит_УстановкаСчетчикаЛицевыеСчета.ЛицевойСчет,
			|	бит_УстановкаСчетчикаЛицевыеСчета.Здание КАК Здание,
			|	ТаблицаУслуг.СпособРаспределения КАК СпособРаспределения,
			|	ТаблицаУслуг.НачальныеПоказания КАК НачальныеПоказания,
			|	ТаблицаУслуг.КонечныеПоказания КАК КонечныеПоказания,
			|	ТаблицаУслуг.Поставщик КАК Поставщик,
			|	ТаблицаУслуг.СтатусКвартиры КАК СтатусКвартиры,
			|	ТаблицаУслуг.ТипКвартиры КАК ТипКвартиры,
			|	ТаблицаУслуг.РежимПотребления КАК РежимПотребления,
			|	ТаблицаУслуг.ОсновнаяУслуга КАК ОсновнаяУслуга,
			|	ТаблицаУслуг.СпособРасчетаУменьшения КАК СпособРасчетаУменьшения,
			|	ТаблицаУслуг.СпособРаспределенияУменьшения КАК СпособРаспределенияУменьшения
			|ИЗ
			|	Документ.бит_УстановкаСчетчика.ЛицевыеСчета КАК бит_УстановкаСчетчикаЛицевыеСчета
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаУслуг КАК ТаблицаУслуг
			|		ПО бит_УстановкаСчетчикаЛицевыеСчета.Услуга = ТаблицаУслуг.Услуга
			|ГДЕ
			|	бит_УстановкаСчетчикаЛицевыеСчета.Ссылка = &Ссылка
			|ИТОГИ
			|	МАКСИМУМ(СпособРаспределения),
			|	МАКСИМУМ(НачальныеПоказания),
			|	МАКСИМУМ(КонечныеПоказания),
			|	МАКСИМУМ(Поставщик),
			|	МАКСИМУМ(СтатусКвартиры),
			|	МАКСИМУМ(ТипКвартиры),
			|	МАКСИМУМ(РежимПотребления),
			|	МАКСИМУМ(ОсновнаяУслуга),
			|	МАКСИМУМ(СпособРасчетаУменьшения),
			|	МАКСИМУМ(СпособРаспределенияУменьшения)
			|ПО
			|	Услуга,
			|	Здание
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ТаблицаУслуг";
			
		КонецЕсли;
		
		ВыборкаУслуг = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаУслуг.Следующий() Цикл
			
			ВыборкаЗданий = ВыборкаУслуг.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаЗданий.Следующий() Цикл
				
				Если ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.УстановкаСчетчика
					ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.СнятиеСчетчика
					ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.ДобавитьУслугиНаСчетчик
					ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.УдалитьУслугиСоСчетчика Тогда
					
					Если НЕ СчетчикСЗависимымиУслугами
						ИЛИ (СчетчикСЗависимымиУслугами И ВыборкаЗданий.ОсновнаяУслуга)Тогда
						
						// Показания счетчиков.
						Движение = Движения.бит_ПоказанияСчетчиков.Добавить();
						Движение.ВидДвижения = ?(ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.УстановкаСчетчика
						ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.ДобавитьУслугиНаСчетчик,
						ВидДвиженияНакопления.Приход,
						ВидДвиженияНакопления.Расход);
						
						Движение.Период      = Дата;
						Движение.Счетчик     = Счетчик;
						Движение.Услуга      = ВыборкаЗданий.Услуга;
						Движение.Объект      = ВыборкаЗданий.Здание;
						Движение.Коэффициент = Счетчик.КоэффициентУмножения;
						
						НачПок = ?(Многотарифный, ВыборкаЗданий.НачальныеПоказания    ,НачальныеПоказания);
						КонПок = ?(Многотарифный, ВыборкаЗданий.КонечныеПоказания,КонечныеПоказания);
						
						Движение.ПоследниеПоказания         = НачПок;
						
						Если Метка = "Подкрутка" Тогда
							Движение.ТекущиеПоказанияИнспектора = 0;
							Движение.ТекущиеПоказанияНаселения  = 0;
							Движение.ПоказанияПодкрутка         = КонПок;
						ИначеЕсли Метка = "Инспектор" Тогда
							Движение.ТекущиеПоказанияИнспектора = КонПок;
							Движение.ТекущиеПоказанияНаселения  = 0;
							Движение.ПоказанияПодкрутка         = 0;
						ИначеЕсли Метка = "Население" Тогда
							Движение.ТекущиеПоказанияИнспектора = 0;
							Движение.ТекущиеПоказанияНаселения  = КонПок;
							Движение.ПоказанияПодкрутка         = 0;
						КонецЕсли;
						
						// БИТ_ЖКХ 29.05.2014	
						Движение.Организация   = СтруктураШапкиДокумента.Организация;
						// БИТ_ЖКХ 29.05.2014
						
					КонецЕсли; 
					
					// Счетчики на услугах.
					НовЗапись = Движения.бит_СчетчикиНаУслугахОбщий.Добавить();
					
					НовЗапись.Период              = Дата;
					НовЗапись.Объект              = ВыборкаЗданий.Здание;
					НовЗапись.Услуга              = ВыборкаЗданий.Услуга;
					НовЗапись.Счетчик             = Счетчик;
					НовЗапись.Использовать        = (ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.УстановкаСчетчика
					ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.ДобавитьУслугиНаСчетчик);
					НовЗапись.ТипСчетчика         = Счетчик.ТипСчетчика;
					НовЗапись.Многотарифный       = Многотарифный;
					НовЗапись.СпособРасчета       = СпособРасчета;
					
					НовЗапись.СпособРаспределения           = ?(СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных,
					ВыборкаЗданий.СпособРаспределения,
					Перечисления.бит_СпособыРаспределения.НеИспользуется);
					НовЗапись.СпособРаспределенияУменьшения = ?(СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных,
					ВыборкаЗданий.СпособРаспределенияУменьшения,
					Перечисления.бит_СпособыРаспределения.НеИспользуется);
					
					НовЗапись.МестоУстановкиСчетчика        = МестоУстановкиСчетчика;
					НовЗапись.Приоритет                     = Приоритет;
					НовЗапись.ИспользоватьСтавкуПоСчетчику  = ИспользоватьСтавкуПоСчетчику;
					
					// БИТ_ЖКХ 17.06.2015{{
					Если Счетчик.ТипСчетчика = Перечисления.бит_ТипСчетчика.Групповой Тогда
						Если ИспользоватьСтавкуПоСчетчику = Ложь и ИспользоватьПравилоУменьшения = Истина Тогда
							Если ВыборкаЗданий.Услуга.Поставщики.Количество() > 0 Тогда 
								НовЗапись.Поставщик                     = ВыборкаЗданий.Услуга.Поставщики[0].Поставщик;
							Иначе
								НовЗапись.Поставщик                     = ВыборкаЗданий.Поставщик;
							КонецЕсли;
							НовЗапись.СтатусКвартиры                = Справочники.бит_СтатусыКвартиры.Приватизированная;
							НовЗапись.ТипКвартиры                   = Справочники.бит_ТипыКвартиры.Отдельная;
							НовЗапись.РежимПотребления              = ВыборкаЗданий.Услуга.ОсновнойРежимПотребления;
						Иначе
							НовЗапись.Поставщик                     = ВыборкаЗданий.Поставщик;
							НовЗапись.СтатусКвартиры                = ВыборкаЗданий.СтатусКвартиры;
							НовЗапись.ТипКвартиры                   = ВыборкаЗданий.ТипКвартиры;
							НовЗапись.РежимПотребления              = ВыборкаЗданий.РежимПотребления;
						КонецЕсли;
					Иначе
						НовЗапись.Поставщик                     = ВыборкаЗданий.Поставщик;
						НовЗапись.СтатусКвартиры                = ВыборкаЗданий.СтатусКвартиры;
						НовЗапись.ТипКвартиры                   = ВыборкаЗданий.ТипКвартиры;
						НовЗапись.РежимПотребления              = ВыборкаЗданий.РежимПотребления;
					КонецЕсли;
					// БИТ_ЖКХ 17.06.2015}}
					
					НовЗапись.СчетчикСЗависимымиУслугами    = СчетчикСЗависимымиУслугами;
					НовЗапись.ОсновнаяУслуга                = ВыборкаЗданий.ОсновнаяУслуга;
					НовЗапись.ИспользоватьПравилоУменьшения = ИспользоватьПравилоУменьшения;
					НовЗапись.СпособРасчетаУменьшения       = ВыборкаЗданий.СпособРасчетаУменьшения;
				// БИТ_ЖКХ 01.12.2015 16:43:30 Начало правки... 
				ИначеЕсли ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.ДобавитьЗданияНаСчетчик Тогда	
					
					// Показания счетчиков.
					Если НЕ СчетчикСЗависимымиУслугами
						ИЛИ (СчетчикСЗависимымиУслугами И ВыборкаЗданий.ОсновнаяУслуга)Тогда
						
						Движение = Движения.бит_ПоказанияСчетчиков.Добавить();
						Движение.ВидДвижения = ?(ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.УстановкаСчетчика
												ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.ДобавитьУслугиНаСчетчик
												ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.ДобавитьЗданияНаСчетчик,
												ВидДвиженияНакопления.Приход,
												ВидДвиженияНакопления.Расход);
						
						Движение.Период      = Дата;
						Движение.Счетчик     = Счетчик;
						Движение.Услуга      = ВыборкаЗданий.Услуга;
						Движение.Объект      = ВыборкаЗданий.Здание;
						Движение.Коэффициент = Счетчик.КоэффициентУмножения;
						Движение.ПоследниеПоказания         = ВыборкаЗданий.НачальныеПоказания;
						Движение.ТекущиеПоказанияИнспектора = ВыборкаЗданий.КонечныеПоказания;
						Движение.ТекущиеПоказанияНаселения  = 0;
						Движение.ПоказанияПодкрутка         = 0;
						Движение.Организация  = СтруктураШапкиДокумента.Организация;
						
					КонецЕсли;
					
					// Счетчики на услугах.
					НовЗапись = Движения.бит_СчетчикиНаУслугахОбщий.Добавить();
					
					НовЗапись.Период						= Дата;
					НовЗапись.Объект						= ВыборкаЗданий.Здание;
					НовЗапись.Услуга						= ВыборкаЗданий.Услуга;
					НовЗапись.Счетчик						= Счетчик;
					НовЗапись.Использовать					= ВыборкаЗданий.Использовать; 
					НовЗапись.ТипСчетчика					= Счетчик.ТипСчетчика;
					НовЗапись.Многотарифный					= ВыборкаЗданий.Многотарифный;
					НовЗапись.СпособРасчета					= ВыборкаЗданий.СпособРасчета;
					НовЗапись.СпособРаспределения			= ВыборкаЗданий.СпособРаспределения;
					НовЗапись.СпособРаспределенияУменьшения = ВыборкаЗданий.СпособРаспределенияУменьшения;
					НовЗапись.МестоУстановкиСчетчика        = ВыборкаЗданий.МестоУстановкиСчетчика;
					НовЗапись.Приоритет                     = ВыборкаЗданий.Приоритет;
					НовЗапись.ИспользоватьСтавкуПоСчетчику  = ВыборкаЗданий.ИспользоватьСтавкуПоСчетчику;
					НовЗапись.Поставщик                     = ВыборкаЗданий.Поставщик;
					НовЗапись.СтатусКвартиры                = ВыборкаЗданий.СтатусКвартиры;
					НовЗапись.ТипКвартиры                   = ВыборкаЗданий.ТипКвартиры;
					НовЗапись.РежимПотребления              = ВыборкаЗданий.РежимПотребления;
					НовЗапись.СчетчикСЗависимымиУслугами    = ВыборкаЗданий.СчетчикСЗависимымиУслугами;
					НовЗапись.ОсновнаяУслуга                = ВыборкаЗданий.ОсновнаяУслуга;
					НовЗапись.ИспользоватьПравилоУменьшения = ВыборкаЗданий.ИспользоватьПравилоУменьшения;
					НовЗапись.СпособРасчетаУменьшения       = ВыборкаЗданий.СпособРасчетаУменьшения;
				// БИТ_ЖКХ 01.12.2015 16:50:59 Конец правки. 
				КонецЕсли;
				
				Выборка = ВыборкаЗданий.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					Движение = Движения.бит_ГрупповыеСчетчики.Добавить();
					Движение.Период           = Дата;
					Движение.Услуга           = Выборка.Услуга;
					Движение.ГрупповойСчетчик = Счетчик;
					Движение.ЛицевойСчет      = Выборка.ЛицевойСчет;
					Движение.Использовать     = (ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.УстановкаСчетчика
					ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.ДобавитьЛицевыеСчетаНаСчетчик
					ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.ДобавитьУслугиНаСчетчик
					ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.ДобавитьЗданияНаСчетчик); // БИТ_ЖКХ 27.11.2015 15:24:29 
					
				КонецЦикла; 
				
			КонецЦикла; 
			
		КонецЦикла; 
		
	КонецЕсли;
	
	Если НЕ СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных Тогда
		Движения_СведениямПоУслугам();
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ДатаПоверки)  Тогда
		
		Движение = Движения.бит_ПоверкаСчетчиков.Добавить();
		Движение.Период        = Дата;
		Движение.Счетчик       = Счетчик;
		Движение.ДатаПоверки   = ДатаПоверки;
		Движение.СнятНаПоверку = (ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.СнятиеСчетчика);
		
	КонецЕсли; 
	
КонецПроцедуры 

// БИТ_ЖКХ Процедура заполняет регистр Сведения по услугам ЛС.
//
// Параметры:
//  СписокЛС    – Массив - Список лицевых счетов.
//
//  СписокУслуг – Массив - Список услуг.
//
Процедура Движения_СведениямПоУслугам()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Момент" , МоментВремени());
	Запрос.УстановитьПараметр("Счетчик", Счетчик);
	
	Если Счетчик.ТипСчетчика = Перечисления.бит_ТипСчетчика.Индивидуальный Тогда
		
		СписокУслуг = Услуги.ВыгрузитьКолонку("Услуга");
		
		Запрос.УстановитьПараметр("ЛицевойСчет", Объект);
		Запрос.УстановитьПараметр("СписокУслуг", СписокУслуг);
		
		Текст = 
		"ВЫБРАТЬ
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга
		|ПОМЕСТИТЬ Счетчики
		|ИЗ
		|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
		|			&Момент,
		|			ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Индивидуальный)
		|				И НЕ Счетчик = &Счетчик
		|				И Объект = &ЛицевойСчет) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
		|ГДЕ
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
		|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
		|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления,
		|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик,
		|	бит_СведенияПоУслугамЛССрезПоследних.Использовать,
		|	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления,
		|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.ОсновнойСпособРасчета КАК ОсновнойСпособРасчета,
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Наименование КАК Наименование,
		|	ВЫБОР
		|		КОГДА Счетчики.Услуга ЕСТЬ NULL 
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьСчетчик,
		|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета
		|ИЗ
		|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
		|			&Момент,
		|			ЛицевойСчет = &ЛицевойСчет
		|				И Услуга В (&СписокУслуг)) КАК бит_СведенияПоУслугамЛССрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Счетчики КАК Счетчики
		|		ПО бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет = Счетчики.Объект
		|			И бит_СведенияПоУслугамЛССрезПоследних.Услуга = Счетчики.Услуга
		|ГДЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.ДА)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Счетчики";
		
	Иначе
		
		Запрос.УстановитьПараметр("Ссылка" , Ссылка);
		
		СписокЗданий = ЛицевыеСчета.ВыгрузитьКолонку("Здание");
		Запрос.УстановитьПараметр("СписокЗданий", СписокЗданий);
		
		Текст = 
		"ВЫБРАТЬ
		|	бит_УстановкаСчетчикаЛицевыеСчета.ЛицевойСчет,
		|	бит_УстановкаСчетчикаЛицевыеСчета.Услуга,
		|	бит_УстановкаСчетчикаЛицевыеСчета.ЛицевойСчет.Наименование КАК Наименование,
		|	бит_УстановкаСчетчикаЛицевыеСчета.Здание
		|ПОМЕСТИТЬ СписокЛС
		|ИЗ
		|	Документ.бит_УстановкаСчетчика.ЛицевыеСчета КАК бит_УстановкаСчетчикаЛицевыеСчета
		|ГДЕ
		|	бит_УстановкаСчетчикаЛицевыеСчета.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга,
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет
		|ПОМЕСТИТЬ Счетчики
		|ИЗ
		|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
		|			&Момент,
		|			ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Групповой)
		|				И СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам)
		|				И НЕ Счетчик = &Счетчик
		|				И Объект В (&СписокЗданий)) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГрупповыеСчетчики.СрезПоследних(&Момент, НЕ ГрупповойСчетчик = &Счетчик) КАК бит_ГрупповыеСчетчикиСрезПоследних
		|		ПО бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик = бит_ГрупповыеСчетчикиСрезПоследних.ГрупповойСчетчик
		|			И бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга = бит_ГрупповыеСчетчикиСрезПоследних.Услуга
		|ГДЕ
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
		|	И бит_ГрупповыеСчетчикиСрезПоследних.Использовать
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
		|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга,
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления,
		|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик,
		|	бит_СведенияПоУслугамЛССрезПоследних.Использовать,
		|	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления,
		|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.ОсновнойСпособРасчета КАК ОсновнойСпособРасчета,
		|	СписокЛС.ЛицевойСчет,
		|	СписокЛС.Услуга,
		|	СписокЛС.Наименование КАК Наименование,
		|	ВЫБОР
		|		КОГДА Счетчики.ЛицевойСчет ЕСТЬ NULL 
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьСчетчик,
		|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета
		|ИЗ
		|	СписокЛС КАК СписокЛС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Момент, ) КАК бит_СведенияПоУслугамЛССрезПоследних
		|		ПО СписокЛС.ЛицевойСчет = бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
		|			И СписокЛС.Услуга = бит_СведенияПоУслугамЛССрезПоследних.Услуга
		|		ЛЕВОЕ СОЕДИНЕНИЕ Счетчики КАК Счетчики
		|		ПО СписокЛС.Услуга = Счетчики.Услуга
		|			И СписокЛС.Здание = Счетчики.Объект
		|			И СписокЛС.ЛицевойСчет = Счетчики.ЛицевойСчет
		|ГДЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.ДА)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СписокЛС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Счетчики";
		
	КонецЕсли; 
	
	Запрос.Текст = Текст;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СведенияПоУслугам = Движения.бит_СведенияПоУслугамЛС;
	
	Пока Выборка.Следующий() Цикл
		
		НоваяЗапись =  СведенияПоУслугам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		НоваяЗапись.Период        = Дата;
		
		Если ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.УстановкаСчетчика
			ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.ДобавитьЛицевыеСчетаНаСчетчик
			ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.ДобавитьЗданияНаСчетчик // БИТ_ЖКХ 02.12.2015 11:12:18
			ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.ДобавитьУслугиНаСчетчик Тогда
			НоваяЗапись.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам;
		Иначе	
			
			НоваяЗапись.СпособРасчета = ?(Выборка.ЕстьСчетчик, Выборка.СпособРасчета, Выборка.ОсновнойСпособРасчета);
			
			Если НоваяЗапись.СпособРасчета = Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления Тогда
				
				// БИТ_ЖКХ 28.05.2014
				// НоваяЗапись.КоличествоЕдиницПотребления = 1;.
				// БИТ_ЖКХ 28.05.2014
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры // Движения_СведениямПоУслугам() 

// Процедура выполняет проверку на повторное установку/снятие счетчика с объекта.
//
Процедура ПроцеракаУстановкиСчетчика(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"   , МоментВремени());
	Запрос.УстановитьПараметр("Ссылка" , Ссылка);
	Запрос.УстановитьПараметр("Счетчик", Счетчик);
	Запрос.УстановитьПараметр("Объект" , Объект);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|	МАКСИМУМ(бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать) КАК Использовать
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			&Дата,
	|			Счетчик = &Счетчик
	|				И НЕ Регистратор = &Ссылка
	|				И Объект = &Объект) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.УстановкаСчетчика
			И Выборка.Использовать Тогда
			
			Отказ = Истина;

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Счетчик " + Счетчик + " уже был установлен на объект: " + Объект + ".");
			
		ИначеЕсли ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.СнятиеСчетчика
			И НЕ Выборка.Использовать Тогда
			
			Отказ = Истина;

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Счетчик " + Счетчик + " уже был снят с объекта: " + Объект + ".");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Проверяем на заполнение обязательные реквизиты.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// БИТ_ЖКХ 24.09.2014
	Попытка
		бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(ЭтотОбъект, Отказ);
	Исключение
	КонецПопытки;
	// БИТ_ЖКХ 24.09.2014
	
КонецПроцедуры

// Обработчик события "ОбработкаПроведения" документа.
//
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Услуга"             ,"Услуга");
	СтруктураПолей.Вставить("НачальныеПоказания" ,"НачальныеПоказания");
	СтруктураПолей.Вставить("КонечныеПоказания"  ,"КонечныеПоказания");
	
	РезультатЗапросаПоУслугам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Услуги", СтруктураПолей);
	ТаблицаУслуг              = РезультатЗапросаПоУслугам.Выгрузить();
	
	ПроцеракаУстановкиСчетчика(Отказ);
	
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаУслуг, Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Если ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.СнятиеСчетчикаСДомов.
	//	ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.УстановкаСчетчикаНаДома Тогда.
	Если Счетчик.ТипСчетчика = Перечисления.бит_ТипСчетчика.Групповой Тогда
		
		Реквизит = ПроверяемыеРеквизиты.Найти("Объект");
		
		Если НЕ Реквизит = Неопределено Тогда
			
			ПроверяемыеРеквизиты.Удалить(Реквизит);
			
		КонецЕсли;
		
		Если ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.ДобавитьЛицевыеСчетаНаСчетчик
			ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.ДобавитьЗданияНаСчетчик  // БИТ_ЖКХ 27.11.2015 16:32:47 
			ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийУстановкаСчетчика.УдалитьЛицевыеСчетаСоСчетчика Тогда
			
			Реквизит = ПроверяемыеРеквизиты.Найти("СпособРасчета");
			Если НЕ Реквизит = Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(Реквизит);
			КонецЕсли;
			
			Реквизит = ПроверяемыеРеквизиты.Найти("Услуги");
			Если НЕ Реквизит = Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(Реквизит);
			КонецЕсли;
			
			Реквизит = ПроверяемыеРеквизиты.Найти("Услуги.Услуга");
			Если НЕ Реквизит = Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(Реквизит);
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
